{"resposta1":"Acesso a uma página web, acontece por um programa cliente conhecido como navegador web ou browser em inglês, ao um outro programa servidor (HTML, PHP, Java, etc) conectados via rede ou internet e roteados pela URL (domínio\/DNS) ou IP (endereço numérico). Esses programas interagem entre si, por exemplo o navegador solicita\/requisita informações ou dados ao programa servidor que contém os dados ou processa-os e retorna ao solicitante. Tais dados podem ser qualquer arquivo (dados de Banco de Dados, processados, encontrados em outros servidores da rede, multimídia etc).  Esse cenário caracteriza uma popular arquitetura de rede conhecida como cliente-servidor.","resposta2amaster":"ns1.ecomt.com.br","resposta2aslave":"ns2.ecomt.com.br","resposta2b":"Cheguei nesse resultado, por boas práticas e por experiencia em já ter registrado domínios, inclusive na própria Locaweb, entre eles cito nuvemminha.com (servidor Owncloud que comentei na entrevista) como ns1.nuvemminha.com (Master). Raciocínio: ns = nameserver, numeral = para indicar qual é o principal ou secundário e assim por diante, dominio = o próprio domínio ou nome do site. Se tiver mais masters e slaves na pergunta e só manter a lógica abordada acima. Poderia descobrir qual deles é o DNS master e slave, se esse domínio fosse real através de dois comandos Linux: \r\ndig dominioouip @ipdns, exemplo: \r\ndig olatray.com.br @1.1.1.1 CNAME ou \r\ndig olatray.com.br  @8.8.8.8 any\r\nAtravés desses comandos conseguiria dizer com certeza qual o master e o slave e se tem outros nomes de DNS.","resposta3":"A mensagem de erro \"550 No Such User Here\", acontece por alguns motivos, eu particularmente depuro o problema sempre utilizando a tática de isolamento e assim eliminando eventuais possibilidades, aqui podemos fazer um teste rápido de envio\/recebimento para outros e-mails de do próprio domínio e de domínios diferentes para analisar de fato o que passa. Uma possível causa desse erro é a falta de autenticação no envio (saída SMTP) resolvendo isso com uma configuração no cliente de e-mail ou escrita incorreta do e-mail pelo usuário (não encontrado tal usuário aqui). Mais uma vez, podemos utilizar o comando dig do Linux para confirma o nome do servidor SMTP,  por exemplo, dig bucaneiropesca.com.br @1.1.1.1 MX e fazer teste pra ver se o servidor responde com um comando ping. Dentre outras possibilidades que encontrei aqui (https:\/\/community.hostek.com\/t\/how-do-i-fix-outlook-error-550-no-such-user-here\/472) e também aqui (https:\/\/serversmtp.com\/smtp-error\/) foram usadas como referência na solução de problemas apresentada pelo pergunta.","resposta4a":"www  >>>>  98732.olatray.com.br.","resposta4b":". >> [IP_Publico_do_dominio]","resposta4c":"Esses resultados podem encontrados com nosso amigo, o comando dig do linux. Exemplos:\r\ndig www.morijo.com.br @1.1.1.1  >> www.morijo.com.br.     299     IN    CNAME    708166.tcdn.com.br.\r\ndig www.liviamassas.com.br @8.8.4.4 CNAME \r\nNesse caso não encontramos o IP do DNS de tipo A para domínio olatray.com.br, pois o mesmo é fictício.","resposta5":"Acredito que hoje temos duas opções: A nativa do próprio Apache versão 2.4 que utilizamos HTML simples para relatório do servidor web (hardware e aplicação) e pode ser encontrada no site oficial do apache (https:\/\/httpd.apache.org\/docs\/current\/mod\/mod_status.html). Isso é possível graças ao módulo mod_status que vem habilitado por default na instalação. Precisando assim do permitir o acesso no arquivo \/etc\/apache2\/mods-enable\/status.conf e descomenta #Require local para acesso externo. Lembrando que do ponto de vista da segurança, não é uma boa prática permite acesso externo ao status do seu servidor, assim estou permitindo isso no meu servidor particular para efeito de teste. Exemplo: \r\nhttp:\/\/3.135.231.183\/server-status. Podemos também passar parâmetro via URL para \" refresh\" da página automaticamente (em segundos).\r\nA outra possibilidade é utilizando o Zabbix que conta com template próprio para o apache via zabbix-agent. Essa abordagem junto com o dashboard Grafana e utilizando monitores de leds acima de 40 polegadas, fica show de bola. Essas informações podemos encontrar aqui nesse link (https:\/\/www.zabbix.com\/integrations\/apache). A outras ferramentas no mercado, mas acredito está bem servidor quem utilizar qualquer uma das mencionadas aqui, afinal, no fundo todas utilizam o modulo mod_status do apache inclusive o Zabbix.","resposta6":"Primeiramente a árvore de diretório inteira. A programas, arquivos e pastas no espaço do Kernel que mesmo com privilégio root não serão apagadas com os diretórios montados ou sendo utilizados pelo sistema. Mas se verificamos antes da exclusão em massa com um simples comando (find \/ -name reboot) resulta onde encontramos o programa reboot, nas pastas \/usr\/lib\/klibc\/bin\/reboot e \/sbin\/reboot, e essas passas infelizmente foram apagadas e ao final da execução do comando rm, portanto não conseguiremos reiniciar o servidor. Esse teste realizei numa máquina virtual com debian 9 Stretch instalado.  "}